[
  {
    "name":"Elena Burceanu",
    "bio":"My interest is in understanding videos in an unsupervised manner, currently working on object tracking for my PhD at University of Bucharest and Institute of Mathematics of the Romanian Academy. I have a strong background in Mathematics and Physics and I have finished my BSc in Computer Science and the MSc in Distributed Systems at University Politehnica Bucharest.",
    "img": "elena_burceanu.jpg",
    "contact":
      {
        "mail":"eburceanu@bitdefender.com",
        "twitter":"ilarele",
        "github":"ilarele"
      }
  },
  {
    "name":"Emanuela Haller",
    "bio":"I am a second year PhD student, co-supervised by Marius Leordeanu (Institute of Mathematics of the Romanian Academy) and Adina Magda Florea (University Politehnica of Bucharest). I have a BSc in Computer Science and a MSc in Artificial Intelligence, both from University Politehnica of Bucharest. My main focus is the problem of unsupervised learning and I am currently working on the task of unsupervised learning of objects from video sequences.",
    "img" : "emanuela_haller.jpg",
    "contact":
      {
        "mail":"ehaller@bitdefender.com",
        "twitter":"",
        "github":""
      }
  },
  {
    "name":"Iulia Duță",
    "bio":" I have a BSc in Computer Science and a MSc in Artificial Intelligence at the University of Bucharest. My research focuses on Graph Neural Networks and their application in Computer Vision. I am particularly interested in developing techniques to create a more structured representation of the video scene. My current goals are to discover object-centric representations in video useful for relational modeling and to analyse the optimisation process of different graph neural networks.",
    "img": "iulia_duta.jpg",
    "contact":
      {
        "mail":"iduta@bitdefender.com",
        "twitter":"DutaIulia",
        "github":""
      }
  },
  {
    "name":"Andrei Nicolicioiu",
    "bio":" I am interested in deep learning methods with a focus on relational representations and graph neural networds. I studied at University Politehnica of Bucharest, where I obtained a Bachelor's degree and a Master's degree in Artificial Inteligence. I researched topics in multilabel classification, video captioning, occluded regions segmentation, few-shot learning, relational processing of visual data.",
    "img": "andrei_nicolicioiu.jpg",
    "contact":
      {
        "mail":"anicolicioiu@bitdefender.com",
        "twitter":"",
        "github":""
      }
  },
  {
    "name":"Florin Brad",
    "bio":"I am interested in neural generative models for natural language processing, especially for code generation. In particular, I am interested in leveraging discrete structure (syntax trees) to improve the expresiveness of the latent space and to guide the generation process.",
    "img": "florin_brad.jpg",
    "contact":
      {
        "mail":"fbrad@bitdefender.com",
        "twitter":"",
        "github":""
      }
  },
  {
    "name":"Andrei Manolache",
    "bio":"I got my bachelor's degree in Mathematics and Computer Sciences from the University of Bucharest and I've currently enrolled in its Artificial Intelligence Master's degree program. I'm interested in unsupervised and self-supervised representation learning, especially using deep neural language models. At the moment I'm tackling the problem of out-of-distribution sample detection in natural language and more general unstructured data.",
    "img": "andrei_manolache.jpg",
    "contact":
      {
        "mail":"amanolache@bitdefender.com",
        "twitter":"andreimano2",
        "github":"andreimano"
      }
  },
  {
    "name":"Florin Gogianu",
    "bio":"Currently pursuing a PhD in Reinforcement Learning unde the supervision of Prof. Lucian Bușoniu following an MSc in Artificial Intelligence from University Politehnica of Bucharest and a BSc in Philosophy. I have a broad interest in Reinforcement Learning topics and I am currently focusing on questions regarding sample efficiency in the context of model-free value-based methods with neural network estimators.",
    "img" : "florin_gogianu.jpg",
    "contact":
      {
        "mail":"fgogianu@bitdefender.com",
        "twitter":"FlorinGogianu",
        "github":"floringogianu"
      }
  },
  {
    "name":"Miruna Roșca",
    "bio":"I am interested in post-quantum cryptography, with a focus on lattice-based solutions. I have a strong background in mathematics and I am currently a second year Phd student in cryptography at École Normale Supérieure de Lyon, working with Damien Stehlé on hardness of lattice problems over rings. More info about me here: http://perso.ens-lyon.fr/miruna.rosca/",
    "img" : "miruna_rosca.jpg",
    "contact":
      {
        "mail":"mrosca@bitdefender.com",
        "twitter":"",
        "github":""
      }
  },
  {
    "name":"Mădălina Bolboceanu",
    "bio":"I obtained both my undergraduate and Master degrees in Mathematics from the University of Bucharest. My goal is to use my strong mathematical skills and experience in mathematical contests and olympiads to solve cryptographic challenges. I am interested in applications of lattices in cryptography, including lattice based homomorphic encryption schemes.",
    "img": "madalina_bolboceanu.jpg",
    "contact":
      {
        "mail":"mbolboceanu@bitdefender.com",
        "twitter":"molbozaur",
        "github":""
      }
  },
  {
    "name":"Radu Țițiu",
    "bio":"I am in my second year as a PhD student in cryptography, under the supervision of Benoit Libert at ENS de Lyon. My focus is on lattice-based cryptography, which proposes promising cryptographic schemes in the eventuality that quantum algorithms could be implemented on quantum devices. Moreover, lattice-based cryptography enables the construction of some provably secure advanced cryptographic primitives including Identity Based Encryption, Attribute Based Encryption, Functional Encryption, Homomorphic Encryption.",
    "img" : "radu_titiu.jpg",
    "contact":
      {
        "mail":"rtitiu@bitdefender.com",
        "twitter":"",
        "github":""
      }
  },
  {
    "name":"Marius Leordeanu",
    "bio":"I am an Associate Professor (Senior Lecturer) at the University Politehnica of Bucharest and senior researcher at the Institute of Mathematics of the Romanian Academy. I am interested in the nature of intelligence, life and consciousness. In particular, my research focuses on computer vision, machine learning and robotics. At the university I teach the graduate level computer vision and robotics classes. I have received a Ph.D. in Robotics from Carnegie Mellon University in 2009 and Bachelor degrees in Mathematics and Computer Science from the City University of New York, 2003.",
    "img" : "marius_leordeanu.jpg",
    "contact":
      {
        "mail":"leordeanu@gmail.com",
        "twitter":"",
        "github":""
      }
  }
]
