[
  {
    "direction": "Machine Learning team",
    "id": "ml",
    "subteams": {
      "": [
        {
          "name": "Elena Burceanu",
          "bio": "I recently defended my PhD thesis in Computer Vision, on `Efficiently Exploiting Space-Time Consensus for Object Segmentation and Tracking in Video`, at University of Bucharest, under Marius Leordeanu and GheorgheStefanescu supervision. My current research interest is in Generalization problems under Distribution Shifts, with a focus on the anomaly detection task.",
          "img": "elena_burceanu.webp",
          "contact": {
            "mail": "eburceanu@bitdefender.com",
            "twitter": "ilarele",
            "github": "ilarele",
            "website": "ilarele.github.io/"
          }
        },
        {
          "name": "Florin Brad",
          "bio": "I am interested in neural generative models for natural language processing, especially for code generation. In particular, I am interested in leveraging discrete structure (syntax trees) to improve the expresiveness of the latent space and to guide the generation process.",
          "img": "florin_brad.webp",
          "contact": {
            "mail": "fbrad@bitdefender.com",
            "twitter": "",
            "github": "",
            "website": ""
          }
        },
        {
          "name": "Andrei Manolache",
          "bio": "I am a Ph.D. student at the IMPRS-IS and ELLIS, under the co-supervision of Mathias Niepert (University of Stuttgart) and Karsten Borgwardt (ETH Zürich & MPI-B) and a Researcher at Bitdefender’s Theoretical Research Laboratory. My focus is on robustness and trustworthiness of Geometric Deep Learning methods.",
          "img": "andrei_manolache.webp",
          "contact": {
            "mail": "amanolache@bitdefender.com",
            "twitter": "andreimano2",
            "github": "andreimano",
            "website": "andreimano.github.io/"
          }
        },
        {
          "name": "Marius Drăgoi",
          "bio": "I studied at Politehnica University of Bucharest, where I obtained a Bachelor's degree in Computer Science and a Master's degree in Artificial Intelligence. I am currently researching the problem of out-of-distribution sample detection and distributional shift in log data.",
          "img": "marius_dragoi.webp",
          "contact": {
            "mail": "mdragoi@bitdefender.com",
            "twitter": "dmarviss",
            "github": "marviss",
            "website": ""
          }
        },
        {
          "name": "Florin Gogianu",
          "bio": "Currently pursuing a PhD in Reinforcement Learning unde the supervision of Prof. Lucian Bușoniu following an MSc in Artificial Intelligence from University Politehnica of Bucharest and a BSc in Philosophy. I have a broad interest in Reinforcement Learning topics and I am currently focusing on questions regarding sample efficiency in the context of model-free value-based methods with neural network estimators.",
          "img": "florin_gogianu.webp",
          "contact": {
            "mail": "fgogianu@bitdefender.com",
            "twitter": "FlorinGogianu",
            "github": "floringogianu",
            "website": ""
          }
        },
        {
          "name": "Ștefan Smeu",
          "bio": "I studied Mathematics and Computer Science at University of Bucharest, where I got my bachelor's degree and currently pursuing it's Artificial Intelligence Master degree program. I am interested in the unsupervised representation learning branch of deeplearning. Nowadays I research the problem of distributional shift and anomaly detection, mainly on visual data.",
          "img": "stefan_smeu.webp",
          "contact": {
            "mail": "ssmeu@bitdefender.com",
            "twitter": "@SmeuStefan",
            "github": "@MrNiceGuy090",
            "website": ""
          }
        },
        {
          "name": "Elisabeta Oneață",
          "bio": "I have obtained my PhD in computer vision from the School of Advanced Studies of the Romanian Academy (SCOSAAR),  with the thesis “Perceptual Models for Computational Visual Analysis”, under the supervision of Prof. Dr. Cristian Sminchisescu. My work focused on 3d human pose estimation and perception in monocular images and videos. Currently I am interested in automatic detection of deepfake visual content.",
          "img": "elisabeta_oneata.webp",
          "contact": {
            "mail": "eoneata@bitdefender.com",
            "twitter": "",
            "github": "",
            "website": "https://scholar.google.com/citations?user=ssHUPeUAAAAJ&hl=en&oi=ao"
          }
        },
        {
          "name": "Dan Oneață",
          "bio": "I received my Ph.D. from Université Grenoble Alpes, where I worked on automatic action recognition in videos. During my postdoctoral research, I started investigating how to integrate vision with other modalities, such as speech and language. This work showed how visual grounding can help with tasks like speech recognition or language documentation, and how multimodal models relate to human learning. At Bitdefender, I apply multimodal learning to detect deepfakes across various media, including images, audio, and video.",
          "img": "dan_oneata.webp",
          "contact": {
            "mail": "doneata@bitdefender.com",
            "twitter": "",
            "github": "@danoneata",
            "website": "https://doneata.bitbucket.io/"
          }
        },
        {
          "name": "Ioana Pintilie",
          "bio": "I am an Artificial Intelligence master’s student at the University of Bucharest, where I also obtained my bachelor’s degree in Computer Science. I am interested in anomaly detection for multivariate time series data, diffusion models, and I have a general interest in NLP topics. Currently, my focus is on large language models.",
          "img": "ioana_pintilie.webp",
          "contact": {
            "mail": "ipintilie@bitdefender.com",
            "twitter": "",
            "github": "",
            "website": ""
          }
        },
        {
          "name": "Cristian Păduraru",
          "bio": "I earned my Bachelor's degree in Computer Science from the University of Bucharest, where I am currently pursuing a Master's program in Artificial Intelligence. My interests include bias identification and correction, as well as model interpretability.",
          "img": "cristi_paduraru.webp",
          "contact": {
            "mail": "cpaduraru@bitdefender.com",
            "twitter": "",
            "github": "",
            "website": ""
          }
        },
        {
          "name": "Antonio Bărbălau",
          "bio": "Currently pursuing a PhD focused on weakly-supervised and self-supervised learning at the University of Bucharest. I've been mainly involved in model stealing, video anomaly detection and speech processing. Presently, I'm working on domain generalization.",
          "img": "antonio_barbalau.webp",
          "contact": {
            "mail": "ext-abarbalau@bitdefender.com",
            "twitter": "",
            "github": "antoniobarbalau",
            "website": ""
          }
        }, 
        {
          "name": "Dragoș (Andu) Boldișor",
          "bio": "I am currently studying for my Master's Degree in Artificial Intelligence at University Politehnica of Bucharest. I am presently researching approaches to deepfake detection.",
          "img": "andu_boldisor.webp",
          "contact": {
            "mail": "dboldisor@bitdefender.com",
            "twitter": "",
            "github": "@Andu199",
            "website": ""
          }
        }
      ]
    }
  },
  {
    "direction": "",
    "id": "ml",
    "subteams": {
    "collaborators": [
      {
        "name": "Andrei Nicolicioiu",
        "bio": "PhD Student @ University of Montreal",
        "img": "andrei_nicolicioiu.webp",
        "contact": {
          "mail": "",
          "twitter": "",
          "github": "",
          "website": ""
        }
      },
      {
        "name": "Teo Poncu",
        "bio": "Research Scientist @ University Politehnica of Bucharest, nVidia DLI University Ambassador",
        "img": "teo_poncu.webp",
        "contact": {
          "twitter":  "", 
            "github" :  "",
            "website":  "",
            "email"  :  ""
        }
      },
      {
        "name": "Dragoș Țânțaru",
        "bio": "Member of Engineering @ poolside",
        "img": "dragos_tantaru.webp",
        "contact": {
          "mail": "",
          "twitter": "",
          "github": "",
          "website": ""
        }
      },
      {
        "name": "Tudor Berariu",
        "bio": "Research Scientist @ UiPath",
        "img": "tudor_berariu.webp",
        "contact": {
          "mail": "",
          "twitter": "",
          "github": "",
          "website": ""
        }
      },
      {
        "name": "Iulia Duta",
        "bio": "PhD Student @ University of Cambridge",
        "img": "iulia_duta.webp",
        "contact": {
          "mail": "",
          "twitter": "",
          "github": "",
          "website": ""
        }
      },
      {
        "name": "Marius Leordeanu",
        "bio": "Prof @  University Politehnica of Bucharest",
        "img": "marius_leordeanu.webp",
        "contact": {
          "mail": "",
          "twitter": "",
          "github": "",
          "website": ""
        }
      }
    ]
  }
}
]
